Revit 2026 API

# BuiltInFailuresRevolutionFailures Class

---

Failures about Revolution.

SystemObject Autodesk.Revit.DBBuiltInFailuresRevolutionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RevolutionFailures
```
```vb
Public NotInheritable Class RevolutionFailures
```
```cpp
public ref class RevolutionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevolutionFailures = class end
```

The BuiltInFailuresRevolutionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawRevolution | Can't create surface of revolution. |
|  | ProfileCrossesRevolutionAxis | The profile must not cross the axis of revolution. |
|  | ProfileNotPlanar | The Profile must lie in a plane. |

#### Reference

Autodesk.Revit.DB Namespace